---
kind: method
id: M:Autodesk.Revit.DB.HostedSweep.RemoveSegment(Autodesk.Revit.DB.Reference)
source: html/14ff1a00-0fd1-cc28-a20f-9e3b00083488.htm
---
# Autodesk.Revit.DB.HostedSweep.RemoveSegment Method

Remove segments from the hosted sweep object.

## Syntax (C#)
```csharp
public void RemoveSegment(
	Reference targetRef
)
```

## Parameters
- **targetRef** (`Autodesk.Revit.DB.Reference`) - Segment's reference which want to be removed.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when regeneration fails.